Repository: Macmod/gtetrinet
Catalog: po/*.po
Languages: cy, ru

source: Couldn't resolve hostname.
cy: Methwyd datrys yr enw gwesteiwr.

source: _Connect to server...
cy: _Cysylltu ar weinydd...
ru: Подключиться к серверу...

source: _Disconnect from server
cy: _Datgysylltu o'r gweinydd
ru: Отключиться от сервера...

source: Change _team...
cy: Newid _tîm...
ru: Сменить команду...

source: _Start game
cy: _Cychwyn gêm
ru: Начать игру

source: _Pause game
cy: _Seibio'r gêm
ru: Пауза

source: _End game
cy: _Gorffen y gêm
ru: Конец игры

source: Detac_h page...
cy: Dat_gysylltu tudalen...

source: Connect
cy: Cysylltu
ru: Подключение

source: Connect to a server
cy: Cysylltu at weinydd
ru: Подключение к серверу

source: Disconnect
cy: Datgysylltu
ru: Отключение

source: Disconnect from the current server
cy: Datgysylltu o'r gweinydd cyfredol
ru: Отключиться от текущего сервера

source: Start game
cy: Cychwyn gêm
ru: Начать игру

source: Start a new game
cy: Cychwyn gêm newydd
ru: Новая игра

source: End game
cy: Gorffen y gêm
ru: Конец игры

source: End the current game
cy: Gorffen y gêm cyfredol
ru: Конец теущей игры

source: Pause game
cy: Seibio'r gêm
ru: Пауза

source: Pause the game
cy: Seibio'r gêm
ru: Пауза

source: Change team
cy: Newid tîm
ru: Сменить команду

source: Change your current team name
cy: Newid enw eich tîm cyfredol
ru: Сменить текущее название команды

source: Detach page
cy: Datgysylltu tudalen
ru: Отсоединить страницу

source: Detach the current notebook page
cy: Datgysylltu y tudalen llyfr nodiadau cyfredol
ru: Отсоединить текущую страницу

source: Game in progress
cy: Yng nghanol gêm
ru: В процессе игры

source: Connected to
cy: Wedi cysyllti i
ru: Подключение к

source: Not connected
cy: Heb gysylltu
ru: Не подключен

source: translator-credits
cy: Dafydd Harries <daf@muse.19inch.net>
ru: Благодарности переводчикам

source: A Tetrinet client for GNOME.
cy: Cleient Tetrinet ar gyfer GNOME.
ru: Tetrinet клиент для GNOME.

source: GTetrinet Home Page
cy: Tudalen Gartref GTetrinet
ru: Домашняя страничка GTetrinet

source: Warning: theme does not have a name, reverting to default.
cy: Rhybudd: nid oes enw gan y thema, yn adfer y rhagosodiad.

source: Connect to server
cy: Wedi cysylltu i'r gweinydd
ru: Подключиться к серверу

source: Team name:
cy: Enw tîm:
ru: Название команды:

source: You must specify a server name.
cy: Mae'n rhaid i chi benodi enw gweinydd.
ru: Вы должны указать имя сервера.

source: Please specify a password to connect as spectator.
cy: Penodwch gyfrinair er mwyn cysylltu fel gwyliwr os gwelwch yn dda.
ru: Вы должны указать пароль для подключения в роли зрителя.

source: Please specify a valid nickname.
cy: Penodwch ffugenw dilys os gwelwch yn dda.
ru: Пожалуйста, укажите допустимый псевдоним.

source: O_riginal
cy: _Gwreiddiol

source: Server address
cy: Cyfeiriad gweinydd
ru: Адрес сервера

source: Connect as a _spectator
cy: Cysylltu fel g_wyliwr

source: _Password:
cy: _Cyfrinair:

source: Spectate game
cy: Gwylio gêm
ru: Зрительская игра

source: _Nick name:
cy: _Ffugenw:

source: _Team name:
cy: Enw _tîm:

source: Player information
cy: Manylion chwaraewr
ru: Инфо об игроке

source: Change Key
cy: Newid Bysell
ru: Сменить клавишу

source: Move right
cy: Symud i'r dde
ru: Вправо

source: Move left
cy: Symud i'r chwith
ru: Влево

source: Move down
cy: Symud i lawr
ru: Вниз

source: Rotate right
cy: Cylchdroi i'r dde
ru: Вращение впр.

source: Rotate left
cy: Cylchdroi i'r chwith
ru: Вращение вл.

source: Drop piece
cy: Gollwng darn
ru: Сбросить

source: Discard special
cy: Gwaredu arbennigion
ru: Отменить

source: Send message
cy: Danfon neges
ru: Сообщение

source: Special to field 1
cy: Arbennigyn i faes 1

source: Special to field 2
cy: Arbennigyn i faes 2

source: Special to field 3
cy: Arbennigyn i faes 3

source: Special to field 4
cy: Arbennigyn i faes 4

source: Special to field 5
cy: Arbennigyn i faes 5

source: Special to field 6
cy: Arbennigyn i faes 6

source: Press new key for "%s"
cy: Gwaswch fysell newydd ar gyfer "%s"
ru: Нажмите новую клавишу для "%s"

source: GTetrinet Preferences
cy: Hoffterau GTetrinet
ru: Настройки GTetrinet

source: Select a theme from the list. Install new themes in ~/.gtetrinet/themes/
cy: Dewiswch thema o'r rhestr. Ymsefydlwch themau newydd yn ~/.gtetrinet/themes/
ru: Выберите тему из списка. Установите новые темы в ~/.gtetrinet/themes/

source: Name:
cy: Enw:
ru: Имя:

source: Author:
cy: Awdur:
ru: Автор:

source: Description:
cy: Disgrifiad:
ru: Описание:

source: Selected Theme
cy: Thema Dewisol
ru: Выбор темы

source: Download new themes
cy: Lawrlwytho themâu newydd

source: Themes
cy: Themau
ru: Темы

source: Enable _Timestamps
cy: Galluogi Marciau _Amser

source: Enable Channel _List
cy: Galluogi _Rhestr Sianeli

source: Partyline
cy: Llinell Barti
ru: Чат

source: Action
cy: Gweithred
ru: Действия

source: Key
cy: Bysell
ru: Клавиша

source: Select an action from the list and press Change Key to change the key associated with the action.
cy: Dewiswch weithred o'r rhestr a gwasgwch Newid Bysell er mwyn newid y bysell sy'n gysylltiedig a'r weithred.
ru: Выберите действие из списка и нажмите 'сменить клавишу' для смены клавиши, ассоциированной с этим действием.

source: Change _key...
cy: Newid _bysell...

source: _Restore defaults
cy: _Adfer rhagosodiadau

source: Keyboard
cy: Bysellfwrdd
ru: Клавиатура

source: Enable _Sound
cy: Galluogi _Sain

source: Enable _MIDI
cy: Galluogi _MIDI

source: Enter command to play a midi file:
cy: Rhowch orchymyn er mwyn chwarae ffeil MIDI:
ru: Введите команду для игры файла midi:

source: The above command is run when a midi file is to be played. The name of the midi file is placed in the environment variable MIDIFILE.
cy: Caiff y gorchymyn uchod ei rhedeg pan mae ffeil MIDI i'w chwarae. Caiff enw y ffeil MIDI ei osod yn y newidyn amgylchol MIDIFILE.
ru: Вышеуказанная команда выполняется, когда необходимо воспроизвести midi файлИмя файла подставляется в переменную среды MIDIFILE

source: Sound
cy: Sain
ru: Звук

source: Error loading theme: cannot load graphics file Falling back to default
cy: Gwall wrth lwytho thema: ni ellir lwytho ffeil graffigion Yn cwympo'n ôl i'r rhagosodiad
ru: Ошибка загрузки темы: не могу загрузить файлы графики Возвращаемся назад к теме по умолчанию

source: Error loading default theme: Aborting... Check for installation errors
cy: Gwall wrth lwytho'r thema rhagosod: Terfynnu... Gwiriwch am wallau ymsefydliad
ru: Ошибка загрузки темы по умолчанию: Прервано... Проверьте установку игры

source: Next piece:
cy: Darn nesaf:
ru: След. фигура:

source: Lines:
cy: Llinellau:
ru: Линий:

source: Level:
cy: Lefel:
ru: Уровень:

source: Active level:
cy: Lefel gweithredol:
ru: Активный уровень:

source: Attacks and defenses:
cy: Ymosodiadau ac amddifyniadau:
ru: Атаки и оборона:

source: Not playing
cy: Ddim yn chwarae
ru: Не играет

source: Specials:
cy: Arbennigion:
ru: Спец.:

source: SERVER
cy: GWEINYDD
ru: Сервер

source: Set nickname to use
cy: Gosod y ffugenw i'w ddefnyddio
ru: Установка псевдонима к использованию

source: NICKNAME
cy: FFUGENW
ru: Псевдоним

source: Set team name
cy: Gosod enw tîm
ru: Установить название команды

source: TEAM
cy: TÎM
ru: Команда

source: Connect as a spectator
cy: Cysylltu fel gwyliwr
ru: Подключиться, как зритель

source: Spectator password
cy: Cyfrinair gwyliwr
ru: Пароль зрителя

source: PASSWORD
cy: CYFRINAIR
ru: Пароль

source: Failed to init GConf: %s
cy: Methwyd ymgychwyn GConf: %s
ru: Ошибка инициализации GConf: %s

source: Playing Fields
cy: Meysydd Chwarae
ru: Игры

source: Winlist
cy: Rhestr ennillion
ru: Победители

source: Name
cy: Enw
ru: Имя

source: Players
cy: Chwaraewyr

source: State
cy: Cyflwr

source: Description
cy: Disgrifiad

source: Channel List
cy: Rhestr Sianeli

source: Team
cy: Tîm
ru: Команда

source: Your name:
cy: Eich enw:
ru: Ваше имя:

source: Your team:
cy: Eich tîm:
ru: Ваша команда:

source: Talking in channel
cy: Yn siarad mewn sianel

source: Disconnected
cy: Wedi Datgysylltu

source: Server disconnected
cy: Datgysylltodd y gweinydd

source: %c%c*** Disconnected from server
cy: %c%c*** Wedi datgysylltu o'r gweinydd

source: Error connecting:
cy: Gwall cysylltu:
ru: Ошибка подключения:

source: %c%c*** Connected to server
cy: %c%c*** Wedi cysylltu i'r gweinydd

source: %c%c*** You have been kicked from the game
cy: %c%c*** Rydych wedi eich cicio o'r gêm

source: %c*** %c%s%c%c has been kicked from the game
cy: %c*** Cafodd %c%s%c%c ei gicio o'r gêm

source: %c*** Team %c%s%c%c has won the game
cy: %c*** Mae'r tîm %c%s%c%c wedi ennill y gêm

source: %c*** %c%s%c%c has won the game
cy: %c*** Mae %c%s%c%c wedi ennill y gêm

source: %c*** The game has %cstarted
cy: %c*** Mae'r gêm wedi %ccychwyn

source: %c*** The game is %cin progress
cy: %c*** Mae'r gêm ar ei %cganol

source: %c*** The game has %cpaused
cy: %c*** Mae'r gêm wedi %cseibio

source: The game has %c%cpaused
cy: Mae'r gêm wedi %c%cseibio

source: %c*** The game has %cresumed
cy: %c*** Mae'r gêm wedi %cailgychwyn

source: The game has %c%cresumed
cy: Mae'r gêm wedi %c%cailgychwyn

source: %c*** The game has %cended
cy: %c*** Mae'r gêm wedi %cgorffen

source: %c*** You have joined %c%s%c%c
cy: %c*** Rydych wedi ymuno a %c%s%c%c

source: %c*** %c%s%c%c has joined the spectators %c%c(%c%s%c%c%c)
cy: %c*** Mae %c%s%c%c wedi ymuno a'r gwylwyr %c%c(%c%s%c%c%c)

source: %c*** %c%s%c%c has left the spectators %c%c(%c%s%c%c%c)
cy: %c*** Mae %c%s%c%c wedi gadael y gwylwyr %c%c(%c%s%c%c%c)

source: No special blocks
cy: Dim blociau arbennig
ru: Без спец. блоков

source: on %c%c%s%c%c
cy: ar %c%c%s%c%c

source: to All
cy: i Bawb

source: by %c%c%s%c%c
cy: gan %c%c%s%c%c

source: %c*** %c%s%c%c is the moderator
cy: %c*** %c%s%c%c yw'r cymedrolwr

source: has left the game
cy: wedi gadael y gêm

source: have left the game
cy: wedi gadael y gêm

source: has joined the game
cy: wedi ymuno'r gêm

source: have joined the game
cy: wedi ymuno'r gêm

source: %s is on team %c%s
cy: Mae %s ar dîm %c%s

source: %s is alone
cy: Mae %s ar ei hun

source: %s are on team %c%s
cy: Mae %s ar dîm %c%s

source: %s are alone
cy: Mae %s ar eu hunain

source: %c*** %c%s%c%c is now on team %c%s
cy: %c*** Mae %c%s%c%c yn awr ar dîm %c%s

source: %c*** %c%s%c%c is now alone
cy: %c*** %c%s%c%c yn awr ar ei hun

source: Score
cy: Sgôr
ru: Очки

source: Tetrinet client
cy: Cleient Tetrinet
ru: Tetrinet клиент

source: Tetrinet client for GNOME
cy: Cleient Tetrinet ar gyfer GNOME
ru: Tetrinet клиент для GNOME.

source: Command to run to play midi files
cy: Y gorchymyn i'w rhedeg er mwyn chwarae ffeiliau MIDI

source: Enable/disable channel list.
cy: Galluogi/analluogi rhestr sianeli.

source: Enable/disable midi music
cy: Galluogi/analluogi cerddoriaeth MIDI

source: Enable/disable sound
cy: Galluogi/analluogi sain

source: Enable/disable timestamps.
cy: Galluogi/analluogi marciau amser.

source: Enables/Disables sound. Keep in mind that the theme that you're using must provide sounds.
cy: Galluogi/analluogi sain. Cofiwch fod yn rhaid i'r thema rydych chi'n ei ddefnyddio ddarparu sain.
ru: Включает/выключает звук. Не заюывайте, что тема, которую вы используете должна содержать звуки

source: Enables/disables midi music. You'll need to enable sound if you want music to work.
cy: Galluogi/analluogi cerddoriaeth MIDI. Fe fydd yn rhaid i chi alluogi sain os ydych eisiau i'r cerddoriaeth weithio.
ru: Включает/отключает midi музыку. Вам необходимо включить звук, если уд так приспичило послушать музыку

source: Enables/disables the channel list. Disable it if you experience problems when connecting or while playing in your favorite tetrinet server.
cy: Galluogi/analluogi y rhestr sianeli. Analluogwch ef os ydych chi'n cael problemau wrth gysylltu neu tra'n chwarae yn eich hoff weinydd Tetrinet.

source: Enables/disables timestamps in the partyline.
cy: Galluogi/analluogi mariau amser yn y llinell barti.

source: Key to discard special
cy: Bysell er mwyn gwaredu arbennigion

source: Key to drop piece
cy: Bysell er mwyn gollwng darn

source: Key to move down
cy: Bysell er mwyn symud i lawr

source: Key to move left
cy: Bysell er mwyn symud i'r chwith

source: Key to move right
cy: Bysell er mwyn symud i'r dde

source: Key to open the fields' message dialog
cy: Bysell er mwyn agor ymgom negeseuon y meysydd

source: Key to rotate clockwise
cy: Bysell er mwyn troelli'n glocwedd

source: Key to rotate counterclockwise
cy: Bysell er mwyn troelli'n gwrthglocwedd

source: Key to use the current special on field 1
cy: Bysell er mwyn defnyddio'r arbennigyn cyfredol ar faes 1

source: Key to use the current special on field 2
cy: Bysell er mwyn defnyddio'r arbennigyn cyfredol ar faes 2

source: Key to use the current special on field 3
cy: Bysell er mwyn defnyddio'r arbennigyn cyfredol ar faes 3

source: Key to use the current special on field 4
cy: Bysell er mwyn defnyddio'r arbennigyn cyfredol ar faes 4

source: Key to use the current special on field 5
cy: Bysell er mwyn defnyddio'r arbennigyn cyfredol ar faes 5

source: Key to use the current special on field 6
cy: Bysell er mwyn defnyddio'r arbennigyn cyfredol ar faes 6

source: Server where you want to play
cy: Y gweinydd lle hoffech chwarae

source: The current theme directory. It should contain a readable "blocks.png" and a "theme.cfg".
cy: Y cyfeiriadur thema cyfredol. Fe ddylai gynnwys "blocks.png" a "theme.cfg" darllenadwy.
ru: Текущий каталог с темой. Он должен содержать читаемый "blocks.png" и "theme.cfg".

source: Theme directory, should end with a '/'
cy: Cyfeiriadur thema, a ddylai orffen efo '/'

source: This command is run when a midi file is to be played. The name of the midi file is placed in the environment variable MIDIFILE.
cy: Caiff y gorchymyn yma ei rhedeg pan mae ffeil MIDI i'w chwarae. Caiff enw y ffeil MIDI ei rhoi yn y newidyn amgylchol MIDIFILE.
ru: Вышеуказанная команда выполняется, когда необходимо воспроизвести midi файл. Имя файла подставляется в переменную среды MIDIFILE.

source: This is the server where GTetrinet will try to connect.
cy: Dyma'r gweinydd lle bydd GTetrinet yn ceisio cysylltu.
ru: Это сервер к которому GTetrinet попытается подключиться.

source: This key discards the current special. This is case insensitive.
cy: Mae'r bysell hwn yn gwaredu'r arbennigyn cyfredol. Nid yw priflythrennedd o bwys.
ru: Эта клавиша отменит текущий special. Она регистронезависимая.

source: This key displays the fields' message dialog. This is case insensitive.
cy: Mae'r bysell hwn yn dangos ymgom neges y meysydd. Nid yw priflythrennedd o bwys.
ru: Эта клавиша отобразит игровой диалог сообщений. Она регистронезависимая.

source: This key drops the block to the ground. This is case insensitive.
cy: Mae'r bysell hwn yn gollwng y bloc i'r ddaear. Nid yw priflythrennedd o bwys.
ru: Эта клавиша сбросит фигуру вниз. Регистронезависима

source: This key moves the block down. This is case insensitive.
cy: Mae'r bysell hwn yn symud y bloc i lawr. Nid yw priflythrennedd o bwys.
ru: Эта клавиша переместит фигуру вниз. Регистронезависима.

source: This key moves the block to the left. This is case insensitive.
cy: Mae'r bysell hwn yn symud y bloc i'r chwith. Nid yw priflythrennedd o bwys.
ru: Эта клавиша переместит фигуру влево. Регистронезависима.

source: This key moves the block to the right. This is case insensitive.
cy: Mae'r bysell hwn yn symud y bloc i'r dde. Nid yw priflythrennedd o bwys.
ru: Эта клавиша переместит фигуру вправо. Регистронезависима.

source: This key rotates the block clockwise. This is case insensitive.
cy: Mae'r bysell hwn yn cylchdroi'r bloc glocwedd. Nid yw priflythrennedd o bwys.
ru: Эта клавиша повернет фигуру по часовой стрелке. Регистронезависима.

source: This key rotates the block counterclockwise. This is case insensitive.
cy: Mae'r bysell hwn yn cylchdroi'r bloc gwrthglocwedd. Nid yw priflythrennedd o bwys.
ru: Эта клавиша повернет фигуру против часовой стрелки. Регистронезависима.

source: This key uses the current special on Player 1's game field.
cy: Mae'r bysell hwn yn defnyddio'r arbennigyn cyfredol ar faes gêm Chwaraewr 1. Nid yw priflythrennedd o bwys.

source: This key uses the current special on Player 2's game field.
cy: Mae'r bysell hwn yn defnyddio'r arbennigyn cyfredol ar faes gêm Chwaraewr 2. Nid yw priflythrennedd o bwys.

source: This key uses the current special on Player 3's game field.
cy: Mae'r bysell hwn yn defnyddio'r arbennigyn cyfredol ar faes gêm Chwaraewr 3. Nid yw priflythrennedd o bwys.

source: This key uses the current special on Player 4's game field.
cy: Mae'r bysell hwn yn defnyddio'r arbennigyn cyfredol ar faes gêm Chwaraewr 4. Nid yw priflythrennedd o bwys.

source: This key uses the current special on Player 5's game field.
cy: Mae'r bysell hwn yn defnyddio'r arbennigyn cyfredol ar faes gêm Chwaraewr 5. Nid yw priflythrennedd o bwys.

source: This key uses the current special on Player 6's game field.
cy: Mae'r bysell hwn yn defnyddio'r arbennigyn cyfredol ar faes gêm Chwaraewr 6. Nid yw priflythrennedd o bwys.

source: This will be the name of your team.
cy: Dyma fydd enw eich tîm.
ru: Это будет имя вашей команды

source: This will be your nickname in the game.
cy: Dyma fydd eich ffugenw yn y gêm.
ru: Это будет ваш игровой псевлоним.

source: Your nickname
cy: Eich ffugenw

source: Your team
cy: Eich tîm

source: (C) 1999, 2000, 2001, 2002, 2003 Ka-shu Wong
ru: (C) 1999, 2000, 2001, 2002, 2003 Ka-shu Won

source: Warning: theme does not have a name
ru: Внимание: тема не имеет названия

source: Original
ru: Оригинальный

source: Password:
ru: Пароль:

source: Nick name:
ru: Псевдоним:

source: Change key...
ru: Сменить клавишу...

source: Restore defaults
ru: Восстановить умолчания

source: Enable Sound
ru: Вкл. звук

source: Enable MIDI
ru: Вкл. MIDI

source: Command to run to play midi files.
ru: Введите команду для игры файла midi:

source: Enable/disable midi music.
ru: Включить/отключить midi музыку.

source: Enable/disable sound.
ru: Включить/выключить звук.

source: Key to discard special.
ru: Клавиша для сброса специальностей. (?)

source: Key to drop piece.
ru: Клавиша для сброса фигуры.

source: Key to move down.
ru: Клавиша для передвижения вниз.

source: Key to move left.
ru: Клавиша для движения влево.

source: Key to move right.
ru: Клавиша для движения вправо.

source: Key to open the fields' message dialog.
ru: Клавиша для открытия диалога игровых сообщений.

source: Key to rotate clockwise.
ru: Клавиша для вращения по часлвлй стрелке.

source: Key to rotate counterclockwise.
ru: Клавиша для вращения против часовой стрелки.

source: Server where you want to play.
ru: Сервер, на котором вы хотите играть.

source: Theme directory, should end with a '/'.
ru: Каталог с темой должен заканчиваться '/'.

source: Your nickname.
ru: Ваш псевдоним.

source: Your team.
ru: Ваша команда.
